[
    {
      "role": "CEO/Chair of Board",
      "name": "Jo-Anne Sinclair",
      "description": "A chief executive officer, the highest-ranking person in a company or other institution, ultimately responsible for making managerial decisions."
    },
    {
      "role": "COO/VP Operations",
      "name": "Jackson Smith",
      "description": "The chief operating officer (COO) is responsible for executing and implementing the operational directives set by the CEO and the board of directors."
    },
    {
      "role": "CFO/VP Administration",
      "name": "Susan Thomas",
      "description": "A chief financial officer, a senior executive with responsibility for the financial affairs of a corporation or other institution. The vice president of administration position is responsible for directing all of the administrative functions of the corporation in accordance with industry standards, regulatory agencies, and company objectives."
    },
    {
      "role": "VP Client Services",
      "name": "Richa Kaur",
      "description": "Responsible for Consumer and Commercial Banking divisions, including lending, investing, risk management, marketing, and technology. Provides a suite of solutions to help retail and commercial customers meet financial goals."
    },
    {
      "role": "CIO",
      "name": "Josee Benjamin",
      "description": "Chief Information Officer (CIO) is the most senior executive responsible for information technology and computer systems that support bank goals."
    },

    {
      "role": "VP Sales & Marketing",
      "name": "Vincent Grey",
      "description": "Responsible for the overall strategic marketing plans for the organization in order to attract potential customers and retain existing ones."
    },
    {
      "role": "Director Financial and Audit Services",
      "name": "Rupa Kharki (she/her/hers)",
      "description": "Ensures company operations comply with national and international laws and regulations, professional standards, and accepted business practices."
    },
    {
      "role": "Director Human Resources",
      "name": "Xun Kuang",
      "description": "Responsible for organizational development, recruitment and staffing, employment law, performance management, employee relations, and compensation and benefits."
    },
    {
      "role": "Director Legal Services/General Counsel",
      "name": "Stien Pedersen",
      "description": "Senior executive managing legal affairs for the company."
    },
    {
      "role": "Director Information Technology",
      "name": "Sandra Bear",
      "description": "Manages IT infrastructure, operations, and services; ensures access and usability of data and services."
    },
    {
      "role": "Director Information Security and CISO",
      "name": "Gus Blue",
      "description": "Responsible for establishing and maintaining the bank’s information security vision, strategy, and program to protect information assets and technologies."
    },
    {
      "role": "Director Accounting",
      "name": "Sam Kong",
      "description": "Responsible for analysis and reconciliation of accounts, and developing and implementing accounting policies, procedures, and controls."
    },
    {
      "role": "Director Physical Security",
      "name": "Valentine Smith",
      "description": "Identifies, assesses, and integrates physical security operations, technology, and policy solutions at the organization."
    },
    {
      "role": "Director Facilities",
      "name": "Mariya Kaperski",
      "description": null
    },
    {
      "role": "Manager, Business Continuity and Disaster Recovery",
      "name": "Abd al-Hamid Alami",
      "description": "Develops, maintains, or implements business continuity and disaster recovery strategies and solutions, including risk assessments and business impact analyses."
    },
    {
      "role": "Manager, Internal Audit",
      "name": "Victoria Gray",
      "description": "Performs full audits including risk management, control management, and financial reliability assessments to ensure compliance."
    },
    {
      "role": "Chief Architect",
      "name": "Cheryl Guru",
      "description": null
    },
    {
      "role": "Manager, Security Architecture",
      "name": "Jean Ngoy",
      "description": "Designs and oversees implementation of security measures for information systems, ensuring compliance with policies and resistance to threats."
    },
    {
      "role": "Solution Architect, Online Banking",
      "name": "Kris Gold",
      "description": null
    },
    {
      "role": "Manager, Application Solutions",
      "name": "Isaac Smith",
      "description": null
    },
    {
      "role": "Lead Developer, Online Banking",
      "name": "Payton Frost",
      "description": null
    },
    {
      "role": "Manager, Operational Risk",
      "name": "Samantha Nettle",
      "description": "Monitors and manages operational and economic risk exposures to minimize risk and establish controls."
    },
    {
      "role": "Manager, Vendor Relations",
      "name": "Yolanda Ferreira",
      "description": null
    },
    {
      "role": "Manager, Purchasing",
      "name": "Samir Hassan",
      "description": "Leads procurement efforts to maximize value from suppliers for business units and partners."
    },
    {
      "role": "Manager, Communications",
      "name": "Yuna Aikawa",
      "description": null
    },
    {
      "role": "Manager, Customer Experience and Community Engagement",
      "name": "Jonathan Carberry",
      "description": "Improves customer experiences and fosters loyalty through high-quality interactions to increase customer satisfaction."
    },
    {
      "role": "Manager of Sales",
      "name": "Roland Wei",
      "description": "Leads a sales team by providing training, setting quotas, analyzing data, and building the sales force."
    },
    {
      "role": "Manager, Marketing",
      "name": "Pran Singh",
      "description": "Develops and executes strategic marketing plans to attract potential customers and retain existing ones."
    },
    {
      "role": "Business Analyst, Online Banking",
      "name": "Linda Analyst",
      "description": null
    },
    {
      "role": "Manager, Contract Management",
      "name": "Esra Sedge",
      "description": null
    },
    {
      "role": "Manager, Compliance Management",
      "name": "Pranee Tan",
      "description": null
    },
    {
      "role": "Manager IT End User Service Desk",
      "name": "Karmen Spruce",
      "description": "Manages daily operations of the service desk, ensuring constant improvement and team development."
    },
    {
      "role": "Manager IT End User Computing",
      "name": "Haydar Katirci",
      "description": "Provides daily operational support for end-user computing services across the organization."
    },
    {
      "role": "Manager IT Telecom and Infrastructure",
      "name": "Jill Harkness",
      "description": "Manages daily operations of infrastructure and telecom staff, ensuring services and infrastructure meet organizational needs."
    },
    {
      "role": "Manager, Data Center and Hosting Services",
      "name": "Tim Morrison",
      "description": "Oversees day-to-day datacenter operations, cloud services contracting, and ensures data availability."
    },
    {
      "role": "Manager of IT Risk Management",
      "name": "Aleksandr Milosevic",
      "description": "Identifies, assesses, and mitigates risks that could affect organizational assets, profitability, or survival."
    },
    {
      "role": "Manager IT, Project Management Office",
      "name": "Jim Wingnut",
      "description": null
    },
    {
      "role": "Left Vacant for future Expansion",
      "name": "tbd",
      "description": null
    }
]
